Revit 2026 API

# FluidTypeGetFluidType Method

---

Gets a fluid type by name.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FluidType GetFluidType(
	Document document,
	string fluidTypeName
)
```
```vb
Public Shared Function GetFluidType (
	document As Document,
	fluidTypeName As String
) As FluidType
```
```cpp
public:
static FluidType^ GetFluidType(
	Document^ document,
	String^ fluidTypeName
)
```
```fsharp
static member GetFluidType :
        document : Document *
        fluidTypeName : string -> FluidType
```

#### Parameters

document Document
     The document.
fluidTypeName String
     The name of fluid type.

#### Return Value

FluidType The fluid type.  if the fluid type was not found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace